In [29]:
import pandas as pd
import numpy as np

In [49]:
pd.Series(np.random.seed(20))

Series([], dtype: float64)

In [57]:
data_first = pd.DataFrame(np.ones(shape=(4,4)),['A','B','C','D'], ['W','X','Y','Z'])

In [58]:
data_first

     W    X    Y    Z
A  1.0  1.0  1.0  1.0
B  1.0  1.0  1.0  1.0
C  1.0  1.0  1.0  1.0
D  1.0  1.0  1.0  1.0

In [54]:
data_first.lookup(['A','B'],['W','X'])

array([1., 1.])

In [76]:
data_second = pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'], ['W','X','Y','Z'])

In [77]:
data_first.loc['A']

W    1.0
X    1.0
Y    1.0
Z    1.0
Name: A, dtype: float64

In [78]:
pd.Series()

Series([], dtype: float64)

In [89]:
data_ser = data_second[data_second['Z'] > 0]

In [90]:
data_second[data_second > 0]

          W         X         Y         Z
A  0.883893  0.195865  0.357537       NaN
B       NaN  0.559696  0.939469       NaN
C  0.503097  0.406414  0.323461       NaN
D       NaN       NaN       NaN  0.245715
E       NaN  1.567633  1.051109  0.406368

In [91]:
data_ser

          W         X         Y         Z
D -0.792017 -0.842368 -1.279503  0.245715
E -0.044195  1.567633  1.051109  0.406368

In [105]:
False | 0

0

In [119]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [120]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [125]:
df = pd.DataFrame(np.random.randn(6,2),hier_index,['A','B'])

In [126]:
df

                   A         B
Groups num
G1     1   -0.219661  1.503398
       2   -1.482385 -0.856164
       3   -0.828693  0.114048
G2     1    0.527728  0.155838
       2    1.301429 -0.994802
       3    2.094665  0.359429

In [127]:
df.index.names = ['Groups','num']

In [128]:
df

                   A         B
Groups num
G1     1   -0.219661  1.503398
       2   -1.482385 -0.856164
       3   -0.828693  0.114048
G2     1    0.527728  0.155838
       2    1.301429 -0.994802
       3    2.094665  0.359429

In [141]:
df.loc['G1',2]['A']

-1.482385050134975

In [142]:
df.xs(1, level='num')

               A         B
Groups
G1     -0.219661  1.503398
G2      0.527728  0.155838

In [150]:
#dropna
#fillna
df.groupby('Groups').describe().transpose()

Groups         G1        G2
A count  3.000000  3.000000
  mean  -0.843580  1.307941
  std    0.631494  0.783489
  min   -1.482385  0.527728
  25%   -1.155539  0.914579
  50%   -0.828693  1.301429
  75%   -0.524177  1.698047
  max   -0.219661  2.094665
B count  3.000000  3.000000
  mean   0.253761 -0.159845
  std    1.185969  0.730224
  min   -0.856164 -0.994802
  25%   -0.371058 -0.419482
  50%    0.114048  0.155838
  75%    0.808723  0.257634
  max    1.503398  0.359429